public class Task4_21 {
    //Определить, является ли число a делителем числа b?
    public static void main(String[] args) {
        int a = 2;
        int b = 4;
        System.out.println(b% a==0? "a - делитель b": "a - не делитель b");
    }
}
